{"modelTopology":{"class_name":"Model","config":{"name":"recommendation_model","layers":[{"name":"user_input","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"user_input"},"inbound_nodes":[]},{"name":"product_input","class_name":"InputLayer","config":{"batch_input_shape":[null,1],"dtype":"float32","sparse":false,"name":"product_input"},"inbound_nodes":[]},{"name":"user_embedding","class_name":"Embedding","config":{"input_dim":51,"output_dim":32,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"user_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["user_input",0,0,{}]]]},{"name":"product_embedding","class_name":"Embedding","config":{"input_dim":119,"output_dim":32,"embeddings_initializer":{"class_name":"RandomUniform","config":{"minval":-0.05,"maxval":0.05,"seed":null}},"embeddings_regularizer":null,"activity_regularizer":null,"embeddings_constraint":null,"mask_zero":null,"input_length":null,"name":"product_embedding","trainable":true,"batch_input_shape":[null,null]},"inbound_nodes":[[["product_input",0,0,{}]]]},{"name":"user_flatten","class_name":"Flatten","config":{"name":"user_flatten","trainable":true},"inbound_nodes":[[["user_embedding",0,0,{}]]]},{"name":"product_flatten","class_name":"Flatten","config":{"name":"product_flatten","trainable":true},"inbound_nodes":[[["product_embedding",0,0,{}]]]},{"name":"dot_product","class_name":"Dot","config":{"axes":-1,"normalize":false,"name":"dot_product","trainable":true},"inbound_nodes":[[["user_flatten",0,0,{}],["product_flatten",0,0,{}]]]}],"input_layers":[["user_input",0,0],["product_input",0,0]],"output_layers":[["dot_product",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"user_embedding/embeddings","shape":[51,32],"dtype":"float32"},{"name":"product_embedding/embeddings","shape":[119,32],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.22.0","convertedBy":null}